OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf44j50.h
extern __at(0x0FC7) __sfr SSPSTAT;

typedef union
  {
  struct
    {
    unsigned BF                 : 1;
    unsigned UA                 : 1;
    unsigned R_NOT_W            : 1;
    unsigned S                  : 1;
    unsigned P                  : 1;
    unsigned D_NOT_A            : 1;
    unsigned CKE                : 1;
    unsigned SMP                : 1;
    };

  struct
    {
    unsigned BF1                : 1;
    unsigned UA1                : 1;
    unsigned R                  : 1;
    unsigned I2C_START          : 1;
    unsigned I2C_STOP           : 1;
    unsigned D                  : 1;
    unsigned CKE1               : 1;
    unsigned SMP1               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned R_W                : 1;
    unsigned S1                 : 1;
    unsigned P1                 : 1;
    unsigned D_A                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_W              : 1;
    unsigned I2C_START1         : 1;
    unsigned I2C_STOP1          : 1;
    unsigned NOT_A              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_WRITE          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_ADDRESS        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned READ_WRITE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA_ADDRESS       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned I2C_READ           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned I2C_DAT            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned R_NOT_W1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned D_NOT_A1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned R1                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned D1                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned D_A1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned R_W1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_W1             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_A1             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_WRITE1         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_ADDRESS1       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned READ_WRITE1        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA_ADDRESS1      : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned I2C_READ1          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned I2C_DAT1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __SSPSTATbits_t;

extern __at(0x0FC7) volatile __SSPSTATbits_t SSPSTATbits;

#define _SSPSTAT_BF             0x01
#define _SSPSTAT_BF1            0x01
#define _SSPSTAT_UA             0x02
#define _SSPSTAT_UA1            0x02
#define _SSPSTAT_R_NOT_W        0x04
#define _SSPSTAT_R              0x04
#define _SSPSTAT_R_W            0x04
#define _SSPSTAT_NOT_W          0x04
#define _SSPSTAT_NOT_WRITE      0x04
#define _SSPSTAT_READ_WRITE     0x04
#define _SSPSTAT_I2C_READ       0x04
#define _SSPSTAT_R_NOT_W1       0x04
#define _SSPSTAT_R1             0x04
#define _SSPSTAT_D_A1           0x04
#define _SSPSTAT_NOT_W1         0x04
#define _SSPSTAT_NOT_WRITE1     0x04
#define _SSPSTAT_READ_WRITE1    0x04
#define _SSPSTAT_I2C_READ1      0x04
#define _SSPSTAT_S              0x08
#define _SSPSTAT_I2C_START      0x08
#define _SSPSTAT_S1             0x08
#define _SSPSTAT_I2C_START1     0x08
#define _SSPSTAT_P              0x10
#define _SSPSTAT_I2C_STOP       0x10
#define _SSPSTAT_P1             0x10
#define _SSPSTAT_I2C_STOP1      0x10
#define _SSPSTAT_D_NOT_A        0x20
#define _SSPSTAT_D              0x20
#define _SSPSTAT_D_A            0x20
#define _SSPSTAT_NOT_A          0x20
#define _SSPSTAT_NOT_ADDRESS    0x20
#define _SSPSTAT_DATA_ADDRESS   0x20
#define _SSPSTAT_I2C_DAT        0x20
#define _SSPSTAT_D_NOT_A1       0x20
#define _SSPSTAT_D1             0x20
#define _SSPSTAT_R_W1           0x20
#define _SSPSTAT_NOT_A1         0x20
#define _SSPSTAT_NOT_ADDRESS1   0x20
#define _SSPSTAT_DATA_ADDRESS1  0x20
#define _SSPSTAT_I2C_DAT1       0x20
#define _SSPSTAT_CKE            0x40
#define _SSPSTAT_CKE1           0x40
#define _SSPSTAT_SMP            0x80
#define _SSPSTAT_SMP1           0x80

//==============================================================================


//==============================================================================
//        SSP1ADD Bits

extern __at(0x0FC8) __sfr SSP1ADD;

typedef union
  {
  struct
    {
    unsigned MSK0               : 1;
    unsigned MSK1               : 1;
    unsigned MSK2               : 1;
    unsigned MSK3               : 1;
    unsigned MSK4               : 1;
    unsigned MSK5               : 1;
    unsigned MSK6               : 1;
    unsigned MSK7               : 1;
    };

  struct
    {
    unsigned MSK01              : 1;
    unsigned MSK11              : 1;
    unsigned MSK21              : 1;
    unsigned MSK31              : 1;
    unsigned MSK41              : 1;
    unsigned MSK51              : 1;
    unsigned MSK61              : 1;
    unsigned MSK71              : 1;
    };
  } __SSP1ADDbits_t;

extern __at(0x0FC8) volatile __SSP1ADDbits_t SSP1ADDbits;

